In [4]:
# problem statement : we are given with ans of various questions related to a person and we need to predict the salary whether 
#the salary is more than 100k or not(0/1)
#to do this we need to make a heirarchical structure to destinguish the class and make it more accurate
#as in the salaries.cv first layer shows the company and then further we have posts and in the last layer we have the degrees they hold
#these factors can help increase accuracy
#decision tree classifier is build
#genie index and entropy is used to measure
#entropy tell us the amount of randomness (directly propotional) high entropy is less acuracy

In [5]:
import pandas as pd

In [6]:
df=pd.read_csv(r"C:\Users\VANSHIKA  JAIN\Downloads\salaries.csv")

In [7]:
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [8]:
df.tail()

     company                  job     degree  salary_more_then_100k
11  facebook      sales executive    masters                      1
12  facebook     business manager  bachelors                      1
13  facebook     business manager    masters                      1
14  facebook  computer programmer  bachelors                      1
15  facebook  computer programmer    masters                      1

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   company                16 non-null     object
 1   job                    16 non-null     object
 2   degree                 16 non-null     object
 3   salary_more_then_100k  16 non-null     int64
dtypes: int64(1), object(3)
memory usage: 640.0+ bytes

In [30]:
#above the data with object as datatype needs to converted into numerical labels known as label encoding
it=df.drop('salary_more_then_100k',axis='columns')

In [31]:
it

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [14]:
target=df['salary_more_then_100k']

In [15]:
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [17]:
from sklearn.preprocessing import LabelEncoder

company_le=LabelEncoder()

In [19]:
company_le=LabelEncoder()
job_le=LabelEncoder()
degree_le=LabelEncoder()

In [32]:
it['company']=company_le.fit_transform(it['company'])

In [33]:
it

    company                  job     degree
0         2      sales executive  bachelors
1         2      sales executive    masters
2         2     business manager  bachelors
3         2     business manager    masters
4         2  computer programmer  bachelors
5         2  computer programmer    masters
6         0      sales executive    masters
7         0  computer programmer  bachelors
8         0     business manager  bachelors
9         0     business manager    masters
10        1      sales executive  bachelors
11        1      sales executive    masters
12        1     business manager  bachelors
13        1     business manager    masters
14        1  computer programmer  bachelors
15        1  computer programmer    masters

In [34]:
it['job']=company_le.fit_transform(it['job'])
it

    company  job     degree
0         2    2  bachelors
1         2    2    masters
2         2    0  bachelors
3         2    0    masters
4         2    1  bachelors
5         2    1    masters
6         0    2    masters
7         0    1  bachelors
8         0    0  bachelors
9         0    0    masters
10        1    2  bachelors
11        1    2    masters
12        1    0  bachelors
13        1    0    masters
14        1    1  bachelors
15        1    1    masters

In [35]:
it['degree']=company_le.fit_transform(it['degree'])

In [36]:
it

    company  job  degree
0         2    2       0
1         2    2       1
2         2    0       0
3         2    0       1
4         2    1       0
5         2    1       1
6         0    2       1
7         0    1       0
8         0    0       0
9         0    0       1
10        1    2       0
11        1    2       1
12        1    0       0
13        1    0       1
14        1    1       0
15        1    1       1

In [25]:
from sklearn.tree import DecisionTreeClassifier

In [27]:
model=DecisionTreeClassifier()

In [28]:
from sklearn.model_selection import train_test_split

In [38]:
X_train,X_test,y_train,y_test=train_test_split(it,target,test_size=0.2,random_state=2)

In [39]:
X_train

    company  job  degree
9         0    0       1
3         2    0       1
1         2    2       1
10        1    2       0
7         0    1       0
14        1    1       0
2         2    0       0
11        1    2       1
6         0    2       1
15        1    1       1
13        1    0       1
8         0    0       0

In [40]:
y_train

9     1
3     1
1     0
10    1
7     0
14    1
2     1
11    1
6     0
15    1
13    1
8     0
Name: salary_more_then_100k, dtype: int64

In [41]:
X_test

    company  job  degree
12        1    0       0
4         2    1       0
5         2    1       1
0         2    2       0

In [42]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [43]:
model.predict([[0,1,1]])

C:\Users\VANSHIKA  JAIN\AppData\Roaming\Python\Python310\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [45]:
model.score(X_test,y_test)

0.75

In [46]:
pred=model.predict(X_test)

In [47]:
pred

array([1, 1, 1, 0], dtype=int64)

In [48]:
from sklearn.metrics import confusion_matrix

In [49]:
cm=confusion_matrix(y_test,pred)

In [50]:
cm

array([[1, 1],
       [0, 2]], dtype=int64)